In [1]:
# import libraries
import os
import pymysql
import pandas as pd

In [2]:
# inisiasi attributes

db_name = "tugas_besar"
db_host = "localhost"
db_username = "root"
db_password = "123456"

In [3]:
# make the database connection

try:
    conn = pymysql.connect(host = db_host,
                          port = int(3306),
                          user = 'root',
                          passwd = db_password,
                          db = db_name)
except e:
    print(e)
    
if conn:
    print("Successfully Connected")
else:
    print("Error")
    
# activate magic function

%load_ext sql
%sql mysql+mysqldb://root@localhost

Successfully Connected
Traceback (most recent call last):
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\engine\base.py", line 145, in __init__
    self._dbapi_connection = engine.raw_connection()
                             ^^^^^^^^^^^^^^^^^^^^^^^
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\engine\base.py", line 3293, in raw_connection
    return self.pool.connect()
           ^^^^^^^^^^^^^^^^^^^
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\pool\base.py", line 452, in connect
    return _ConnectionFairy._checkout(self)
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\pool\base.py", line 1268, in _checkout
    fairy = _ConnectionRecord.checkout(pool)
            ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\pool\base.py", line 716, in checkout
    rec = pool._do_get()
          ^^^^^^^^^^^^^^
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\pool\impl.py", line 168, in _do_get
    with util.safe_reraise():
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\util\langhelpers.py", line 147, in __exit__
    raise exc_value.with_traceback(exc_tb)
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\pool\impl.py", line 166, in _do_get
    return self._create_connection()
           ^^^^^^^^^^^^^^^^^^^^^^^^^
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\pool\base.py", line 393, in _create_connection
    return _ConnectionRecord(self)
           ^^^^^^^^^^^^^^^^^^^^^^^
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\pool\base.py", line 678, in __init__
    self.__connect()
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\pool\base.py", line 902, in __connect
    with util.safe_reraise():
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\util\langhelpers.py", line 147, in __exit__
    raise exc_value.with_traceback(exc_tb)
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\pool\base.py", line 898, in __connect
    self.dbapi_connection = connection = pool._invoke_creator(self)
                                         ^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\engine\create.py", line 637, in connect
    return dialect.connect(*cargs, **cparams)
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\engine\default.py", line 616, in connect
    return self.loaded_dbapi.connect(*cargs, **cparams)
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\MySQLdb\__init__.py", line 123, in Connect
    return Connection(*args, **kwargs)
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\MySQLdb\connections.py", line 185, in __init__
    super().__init__(*args, **kwargs2)
MySQLdb.OperationalError: (1045, "Access denied for user 'root'@'localhost' (using password: NO)")

The above exception was the direct cause of the following exception:

Traceback (most recent call last):
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sql\magic.py", line 196, in execute
    conn = sql.connection.Connection.set(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sql\connection.py", line 70, in set
    cls.current = existing or Connection(descriptor, connect_args, creator)
                              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sql\connection.py", line 55, in __init__
    self.internal_connection = engine.connect()
                               ^^^^^^^^^^^^^^^^
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\engine\base.py", line 3269, in connect
    return self._connection_cls(self)
           ^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\engine\base.py", line 147, in __init__
    Connection._handle_dbapi_exception_noconnection(
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\engine\base.py", line 2431, in _handle_dbapi_exception_noconnection
    raise sqlalchemy_exception.with_traceback(exc_info[2]) from e
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\engine\base.py", line 145, in __init__
    self._dbapi_connection = engine.raw_connection()
                             ^^^^^^^^^^^^^^^^^^^^^^^
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\engine\base.py", line 3293, in raw_connection
    return self.pool.connect()
           ^^^^^^^^^^^^^^^^^^^
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\pool\base.py", line 452, in connect
    return _ConnectionFairy._checkout(self)
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\pool\base.py", line 1268, in _checkout
    fairy = _ConnectionRecord.checkout(pool)
            ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\pool\base.py", line 716, in checkout
    rec = pool._do_get()
          ^^^^^^^^^^^^^^
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\pool\impl.py", line 168, in _do_get
    with util.safe_reraise():
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\util\langhelpers.py", line 147, in __exit__
    raise exc_value.with_traceback(exc_tb)
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\pool\impl.py", line 166, in _do_get
    return self._create_connection()
           ^^^^^^^^^^^^^^^^^^^^^^^^^
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\pool\base.py", line 393, in _create_connection
    return _ConnectionRecord(self)
           ^^^^^^^^^^^^^^^^^^^^^^^
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\pool\base.py", line 678, in __init__
    self.__connect()
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\pool\base.py", line 902, in __connect
    with util.safe_reraise():
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\util\langhelpers.py", line 147, in __exit__
    raise exc_value.with_traceback(exc_tb)
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\pool\base.py", line 898, in __connect
    self.dbapi_connection = connection = pool._invoke_creator(self)
                                         ^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\engine\create.py", line 637, in connect
    return dialect.connect(*cargs, **cparams)
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\sqlalchemy\engine\default.py", line 616, in connect
    return self.loaded_dbapi.connect(*cargs, **cparams)
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\MySQLdb\__init__.py", line 123, in Connect
    return Connection(*args, **kwargs)
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "D:\anaconda3\envs\MySQL\Lib\site-packages\MySQLdb\connections.py", line 185, in __init__
    super().__init__(*args, **kwargs2)
sqlalchemy.exc.OperationalError: (MySQLdb.OperationalError) (1045, "Access denied for user 'root'@'localhost' (using password: NO)")
(Background on this error at: https://sqlalche.me/e/20/e3q8)

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [4]:
# masuk kedalam extension mysql

%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [5]:
%reload_ext sql

In [6]:
# membuat koneksi ke database MySQL
                                                                                                                                                                                                                                      
%sql mysql+mysqldb://root:123456@localhost

In [7]:
# melihat seluruh isi database yang ada pada MySQL 

%sql SHOW DATABASES;

 * mysql+mysqldb://root:***@localhost
20 rows affected.

[('balqisdwianfitrizamzami',),
 ('belanja_online',),
 ('db_dml_lanjutan',),
 ('db_join_buku',),
 ('db_join_kampus',),
 ('db_latihan1',),
 ('information_schema',),
 ('kepegawaian',),
 ('komik_coba1',),
 ('latihan2',),
 ('mysql',),
 ('online_shop',),
 ('performance_schema',),
 ('posttest',),
 ('pretest',),
 ('produk',),
 ('skema_apotik',),
 ('tugas_besar',),
 ('tugas_prak1',),
 ('tugas_rumah',)]

In [9]:
# menggunakan database yang diinginkan
%sql USE tugas_besar;

 * mysql+mysqldb://root:***@localhost
0 rows affected.

[]

In [41]:
# membaca dataset CSV
df = pd.read_csv('financial_transactions.csv')

# menampilkan 5 baris pertama
df.head()

,transaction_id,date,customer_id,amount,type,description
0,1,10/26/2020,926,6478.39,credit,Expect series shake art again our.
1,2,1/8/2020,466,1255.95,credit,Each left similar likely coach take.
2,3,9/2/2019,110,7969.68,debit,Direction wife job pull determine leader move ...
3,4,12/2/2020,142,2927.41,credit,Agree reveal buy black already.
4,5,12/2/2020,944,4661.88,debit,Child relationship show college whom speech.

In [42]:
# mengecek apakah terdapat nilai NaN pada dataset

df.isna().sum()

transaction_id    0
date              0
customer_id       0
amount            0
type              0
description       0
dtype: int64

In [43]:
# mengecek apakah terdapat data duplikat pada dataset

is_duplicate = df.duplicated().any()

if is_duplicate:
    print("Terdapat data duplikat dalam dataset.")
else:
    print("Tidak ada data duplikat dalam dataset.")

Tidak ada data duplikat dalam dataset.

In [44]:
# menambah kolom baru "type_id" agar memudahkan normalisasi berdasarkan kolom yang ada

df['type_id'] = 0

df.loc[df['type'] == 'credit', 'type_id'] = 1
df.loc[df['type'] == 'debit', 'type_id'] = 2
df.loc[df['type'] == 'transfer', 'type_id'] = 3

# mengubah format tanggal
df['date'] = pd.to_datetime(df['date']).dt.strftime('%Y-%m-%d')

# mengatur urutan kolom
column_order = ['transaction_id', 'date', 'customer_id', 'amount', 'type_id', 'type', 'description']
df = df[column_order]

In [46]:
# mengkonversi dataset yang sudah di proses ke .csv

df.to_csv('update_dataset.csv', index=False)

In [47]:
df = pd.read_csv('update_dataset.csv')

df.head()

,transaction_id,date,customer_id,amount,type_id,type,description
0,1,2020-10-26,926,6478.39,1,credit,Expect series shake art again our.
1,2,2020-01-08,466,1255.95,1,credit,Each left similar likely coach take.
2,3,2019-09-02,110,7969.68,2,debit,Direction wife job pull determine leader move ...
3,4,2020-12-02,142,2927.41,1,credit,Agree reveal buy black already.
4,5,2020-12-02,944,4661.88,2,debit,Child relationship show college whom speech.

### melakukan normalisasi 2NF sehingga bisa di breakdown menjadi beberapa tabel :

Berikut adalah pembagian tabel berdasarkan normalisasi 2NF untuk dataset yang digunakan :
tabel transactions, tabel transaction_types, dan tabel transaction_details.

Dengan normalisasi 2NF, struktur tabel akan menjadi sebagai berikut:

Tabel "transactions": <br>
transaction_id (Primary Key) <br>
date <br>
customer_id <br>
amount <br>

Tabel "transaction_types": <br>
type_id (Primary Key) <br>
type <br>

Tabel "transaction_details": <br>
transaction_id (Foreign Key referencing Transactions.transaction_id) <br>
description <br>

Dengan membagi dataset ke dalam tabel-tabel tersebut, kita dapat menjaga integritas data, menghindari redundansi, dan memfasilitasi pengambilan data yang lebih efisien.

Perlu dicatat bahwa normalisasi 2NF mungkin tidak memisahkan semua atribut menjadi tabel terpisah dalam kasus ini, karena tidak ada atribut yang bergantung pada kombinasi subset kunci primer. Namun, dengan memisahkan informasi tentang jenis transaksi ke dalam tabel terpisah, kita dapat menghindari duplikasi data dan mencapai normalisasi yang lebih baik.

Selanjutnya, setelah normalisasi 2NF, Anda dapat menggunakan syntax DDL (Data Definition Language) seperti yang telah dijelaskan sebelumnya untuk membuat tabel-tabel tersebut dalam database MySQL.

#### membuat tabel transactions :

In [31]:
%%sql

CREATE TABLE transactions (
    transaction_id INT PRIMARY KEY,
    date DATE,
    customer_id INT,
    amount DECIMAL(10,2),
    type_id INT
);

DESC transactions;

 * mysql+mysqldb://root:***@localhost
0 rows affected.
5 rows affected.

[('transaction_id', 'int', 'NO', 'PRI', None, ''),
 ('date', 'date', 'YES', '', None, ''),
 ('customer_id', 'int', 'YES', '', None, ''),
 ('amount', 'decimal(10,2)', 'YES', '', None, ''),
 ('type_id', 'int', 'YES', '', None, '')]

#### membuat tabel transaction_types :

In [32]:
%%sql

CREATE TABLE transaction_types (
    type_id INT PRIMARY KEY,
    type VARCHAR(255)
);

DESC transaction_types;

 * mysql+mysqldb://root:***@localhost
0 rows affected.
2 rows affected.

[('type_id', 'int', 'NO', 'PRI', None, ''),
 ('type', 'varchar(255)', 'YES', '', None, '')]

#### membuat tabel transaction_details :

In [33]:
%%sql

CREATE TABLE transaction_details(
    transaction_id INT,
    description VARCHAR(255)
);

DESC transaction_details;

 * mysql+mysqldb://root:***@localhost
0 rows affected.
2 rows affected.

[('transaction_id', 'int', 'YES', '', None, ''),
 ('description', 'varchar(255)', 'YES', '', None, '')]

In [36]:
# melihat tabel pada database yang pilih (database = test)

%sql SHOW TABLES;

 * mysql+mysqldb://root:***@localhost
3 rows affected.

[('transaction_details',), ('transaction_types',), ('transactions',)]

### mengisi masing-masing tabel dengan minimal 30 row :

In [10]:
%%sql

-- Mengisi tabel transactions
INSERT INTO transactions (transaction_id, date, customer_id, amount, type_id)
SELECT transaction_id, date, customer_id, amount, type_id
FROM update_dataset
LIMIT 66;

SELECT * FROM transactions;

 * mysql+mysqldb://root:***@localhost
66 rows affected.
66 rows affected.

[(1, datetime.date(2020, 10, 26), 926, Decimal('6478.39'), 1),
 (2, datetime.date(2020, 1, 8), 466, Decimal('1255.95'), 1),
 (3, datetime.date(2019, 9, 2), 110, Decimal('7969.68'), 2),
 (4, datetime.date(2020, 12, 2), 142, Decimal('2927.41'), 1),
 (5, datetime.date(2020, 12, 2), 944, Decimal('4661.88'), 2),
 (6, datetime.date(2021, 4, 25), 900, Decimal('3649.68'), 1),
 (7, datetime.date(2020, 6, 19), 458, Decimal('504.24'), 1),
 (8, datetime.date(2022, 9, 8), 573, Decimal('8088.01'), 1),
 (9, datetime.date(2022, 1, 30), 950, Decimal('3006.30'), 1),
 (10, datetime.date(2020, 8, 20), 728, Decimal('1008.62'), 1),
 (11, datetime.date(2019, 12, 9), 908, Decimal('4615.87'), 2),
 (12, datetime.date(2019, 1, 18), 585, Decimal('405.19'), 2),
 (13, datetime.date(2018, 4, 15), 227, Decimal('5938.56'), 1),
 (14, datetime.date(2019, 6, 6), 565, Decimal('3516.95'), 2),
 (15, datetime.date(2022, 1, 17), 818, Decimal('9454.59'), 1),
 (16, datetime.date(2020, 12, 8), 751, Decimal('3415.26'), 1),
 (17, datetime.date(2021, 6, 5), 658, Decimal('9751.08'), 3),
 (18, datetime.date(2022, 5, 23), 296, Decimal('1676.77'), 3),
 (19, datetime.date(2020, 1, 25), 681, Decimal('5159.90'), 2),
 (20, datetime.date(2020, 2, 19), 33, Decimal('6018.28'), 2),
 (21, datetime.date(2020, 4, 9), 611, Decimal('2359.42'), 3),
 (22, datetime.date(2021, 3, 19), 988, Decimal('7626.52'), 2),
 (23, datetime.date(2019, 10, 24), 383, Decimal('5356.25'), 2),
 (24, datetime.date(2021, 9, 2), 8, Decimal('2488.02'), 1),
 (25, datetime.date(2022, 9, 7), 497, Decimal('7752.41'), 1),
 (26, datetime.date(2018, 9, 4), 531, Decimal('987.32'), 1),
 (27, datetime.date(2018, 5, 16), 355, Decimal('3919.23'), 1),
 (28, datetime.date(2021, 8, 29), 570, Decimal('1281.53'), 3),
 (29, datetime.date(2021, 1, 18), 915, Decimal('1820.42'), 1),
 (30, datetime.date(2022, 6, 5), 69, Decimal('5771.55'), 3),
 (31, datetime.date(2020, 7, 10), 531, Decimal('3596.93'), 1),
 (32, datetime.date(2022, 7, 10), 343, Decimal('7107.40'), 1),
 (33, datetime.date(2022, 11, 16), 570, Decimal('483.28'), 1),
 (34, datetime.date(2018, 3, 30), 950, Decimal('2005.85'), 3),
 (35, datetime.date(2020, 3, 28), 839, Decimal('4914.61'), 3),
 (36, datetime.date(2019, 11, 30), 439, Decimal('3934.16'), 2),
 (37, datetime.date(2021, 7, 14), 590, Decimal('4774.77'), 3),
 (38, datetime.date(2022, 6, 16), 997, Decimal('6247.55'), 3),
 (39, datetime.date(2018, 8, 25), 183, Decimal('7211.23'), 3),
 (40, datetime.date(2022, 2, 8), 815, Decimal('7181.74'), 3),
 (41, datetime.date(2020, 8, 6), 120, Decimal('9259.66'), 2),
 (42, datetime.date(2022, 1, 6), 453, Decimal('8818.31'), 3),
 (43, datetime.date(2021, 12, 9), 416, Decimal('4723.88'), 3),
 (44, datetime.date(2019, 6, 4), 252, Decimal('919.33'), 3),
 (45, datetime.date(2021, 9, 15), 514, Decimal('8037.19'), 1),
 (46, datetime.date(2023, 3, 5), 410, Decimal('468.79'), 2),
 (47, datetime.date(2021, 3, 14), 340, Decimal('9017.15'), 1),
 (48, datetime.date(2021, 12, 20), 433, Decimal('932.48'), 1),
 (49, datetime.date(2021, 6, 27), 864, Decimal('592.05'), 3),
 (50, datetime.date(2022, 5, 27), 254, Decimal('1485.95'), 3),
 (51, datetime.date(2020, 6, 15), 508, Decimal('2087.57'), 3),
 (52, datetime.date(2022, 1, 19), 599, Decimal('6242.70'), 2),
 (53, datetime.date(2020, 11, 19), 603, Decimal('2939.09'), 1),
 (54, datetime.date(2021, 1, 2), 511, Decimal('8784.22'), 1),
 (55, datetime.date(2021, 12, 27), 681, Decimal('5765.17'), 2),
 (56, datetime.date(2023, 2, 11), 477, Decimal('5095.08'), 1),
 (57, datetime.date(2020, 5, 21), 919, Decimal('2645.87'), 2),
 (58, datetime.date(2022, 3, 24), 106, Decimal('2052.33'), 1),
 (59, datetime.date(2022, 1, 19), 757, Decimal('1756.62'), 2),
 (60, datetime.date(2021, 1, 24), 549, Decimal('4539.42'), 1),
 (61, datetime.date(2018, 8, 31), 54, Decimal('5392.24'), 2),
 (62, datetime.date(2021, 11, 3), 421, Decimal('2253.30'), 2),
 (63, datetime.date(2019, 3, 23), 898, Decimal('6185.24'), 1),
 (64, datetime.date(2021, 10, 17), 970, Decimal('2552.75'), 1),
 (65, datetime.date(2018, 9, 6), 639, Decimal('7342.83'), 3),
 (66, datetime.date(2020, 9, 13), 502, Decimal('3609.61'), 1)]

In [12]:
%%sql

-- Mengisi tabel transaction_types
REPLACE INTO transaction_types (type_id, type)
SELECT type_id, type
FROM update_dataset;

SELECT * FROM transaction_types;

 * mysql+mysqldb://root:***@localhost
25341 rows affected.
3 rows affected.

[(1, 'credit'), (2, 'debit'), (3, 'transfer')]

In [13]:
%%sql

-- Mengisi tabel transaction_details
REPLACE INTO transaction_details (transaction_id, description)
SELECT transaction_id, description
FROM update_dataset
LIMIT 66;

SELECT * FROM transaction_details;

 * mysql+mysqldb://root:***@localhost
66 rows affected.
66 rows affected.

[(1, 'Expect series shake art again our.'),
 (2, 'Each left similar likely coach take.'),
 (3, 'Direction wife job pull determine leader move college.'),
 (4, 'Agree reveal buy black already.'),
 (5, 'Child relationship show college whom speech.'),
 (6, 'Century front item.'),
 (7, 'Market cover loss hotel send.'),
 (8, 'Trouble reason speak involve.'),
 (9, 'Popular three war arm best.'),
 (10, 'Old see watch no.'),
 (11, 'Million explain rule boy agree can.'),
 (12, 'Us save attention interest country short.'),
 (13, 'Media organization structure their cut not where few.'),
 (14, 'Available smile make star majority.'),
 (15, 'Fund house head course around strategy lead.'),
 (16, 'Main few character air.'),
 (17, 'Listen operation enough those society open.'),
 (18, 'Property strategy represent that.'),
 (19, 'Soldier green age much sound write chair.'),
 (20, 'What single suggest now stop.'),
 (21, 'Support do interesting citizen phone energy consider.'),
 (22, 'This pass civil education.'),
 (23, 'Choose between staff southern fine not manager nothing.'),
 (24, 'Speak ever piece whom indicate she.'),
 (25, 'She cover impact program physical.'),
 (26, 'Newspaper region sister whose man fight usually.'),
 (27, 'Lead talk military including system sometimes few within.'),
 (28, 'Have focus admit again.'),
 (29, 'Write allow on.'),
 (30, 'Relate small employee.'),
 (31, 'Wish not live be practice.'),
 (32, 'Hour down professor risk wear.'),
 (33, 'Popular article light indeed.'),
 (34, 'Yet cover consider national your successful computer.'),
 (35, 'Hope moment value article would economic point technology.'),
 (36, 'Newspaper well computer population recently price.'),
 (37, 'Customer sort huge.'),
 (38, 'Message wear indicate.'),
 (39, 'Trip carry camera upon reality doctor adult.'),
 (40, 'Probably leg indicate.'),
 (41, 'Or few there notice once down indeed per.'),
 (42, 'Research open catch government left.'),
 (43, 'Single understand individual together.'),
 (44, 'Heavy would camera high other appear next.'),
 (45, 'Human president myself young option try.'),
 (46, 'Run us scientist computer.'),
 (47, 'This western whose raise.'),
 (48, 'Own pick someone claim sound watch rise.'),
 (49, 'Threat management consumer resource here else.'),
 (50, 'Important stock lot support.'),
 (51, 'Not building manager road.'),
 (52, 'Budget station reach carry data guess culture space.'),
 (53, 'Improve professor animal fish world.'),
 (54, 'Inside Republican suddenly various key.'),
 (55, 'Reduce meet government.'),
 (56, 'Program should color author should author recent market.'),
 (57, 'Can thousand natural opportunity certainly.'),
 (58, 'Maybe provide happy impact another forget.'),
 (59, 'Well though current send.'),
 (60, 'Religious happen start single carry.'),
 (61, 'Pass agency than although and.'),
 (62, 'Put science recognize rest entire.'),
 (63, 'Green campaign here from.'),
 (64, 'Speak even thought wrong.'),
 (65, 'Choice guess process central.'),
 (66, 'Quality church seven factor couple.')]

### Melakukan advanced query untuk menemukan insight yang menarik :

In [25]:
%%sql

-- Menambahkan foreign key dari tabel yang sudah ada

ALTER TABLE transactions
ADD FOREIGN KEY (type_id) REFERENCES transaction_types(type_id);

 * mysql+mysqldb://root:***@localhost
66 rows affected.

[]

In [28]:
%%sql

-- Menambahkan foreign key dari tabel yang sudah ada

ALTER TABLE transactions ADD INDEX idx_transaction_id (transaction_id);

ALTER TABLE transactions
ADD FOREIGN KEY (transaction_id) REFERENCES transactions(transaction_id);

 * mysql+mysqldb://root:***@localhost
0 rows affected.
66 rows affected.

[]

In [29]:
%%sql

-- Mengekstrak record berdasarkan kriteria baris tertentu dari keseluruhan data record
SELECT *
FROM transactions
WHERE transaction_id = 66;

 * mysql+mysqldb://root:***@localhost
1 rows affected.

[(66, datetime.date(2020, 9, 13), 502, Decimal('3609.61'), 1)]

In [14]:
%%sql

-- Menampilkan total jumlah transaksi berdasarkan jenis transaksi
SELECT type_id, COUNT(*) AS total_transactions
FROM transactions
GROUP BY type_id;

 * mysql+mysqldb://root:***@localhost
3 rows affected.

[(1, 30), (2, 18), (3, 18)]

In [30]:
%%sql

-- Menampilkan total jumlah transaksi per bulan
SELECT MONTH(date) AS month, COUNT(*) AS total_transactions
FROM transactions
GROUP BY MONTH(date)
ORDER BY MONTH(date) ASC;

 * mysql+mysqldb://root:***@localhost
12 rows affected.

[(1, 11),
 (2, 3),
 (3, 7),
 (4, 3),
 (5, 4),
 (6, 8),
 (7, 3),
 (8, 5),
 (9, 8),
 (10, 3),
 (11, 4),
 (12, 7)]

In [16]:
%%sql

-- Menampilkan 10 pelanggan dengan total nilai transaksi tertinggi
SELECT customer_id, SUM(amount) AS total_amount
FROM transactions
GROUP BY customer_id
ORDER BY total_amount DESC
LIMIT 10;

 * mysql+mysqldb://root:***@localhost
10 rows affected.

[(681, Decimal('10925.07')),
 (658, Decimal('9751.08')),
 (818, Decimal('9454.59')),
 (120, Decimal('9259.66')),
 (340, Decimal('9017.15')),
 (453, Decimal('8818.31')),
 (511, Decimal('8784.22')),
 (573, Decimal('8088.01')),
 (514, Decimal('8037.19')),
 (110, Decimal('7969.68'))]

In [31]:
%%sql

-- Menampilkan rata-rata nilai transaksi per bulan
SELECT MONTH(date) AS month, AVG(amount) AS average_amount
FROM transactions
GROUP BY MONTH(date)
ORDER BY MONTH(date) ASC;

 * mysql+mysqldb://root:***@localhost
12 rows affected.

[(1, Decimal('4658.510909')),
 (2, Decimal('6098.366667')),
 (3, Decimal('4610.070000')),
 (4, Decimal('3982.553333')),
 (5, Decimal('2431.955000')),
 (6, Decimal('3673.790000')),
 (7, Decimal('5159.700000')),
 (8, Decimal('4830.656000')),
 (9, Decimal('5784.383750')),
 (10, Decimal('4795.796667')),
 (11, Decimal('2402.457500')),
 (12, Decimal('3863.135714'))]

In [33]:
%%sql

-- Menerapkan operator AND
SELECT *
FROM transactions
WHERE transaction_id=66 AND amount=3609.61;

 * mysql+mysqldb://root:***@localhost
1 rows affected.

[(66, datetime.date(2020, 9, 13), 502, Decimal('3609.61'), 1)]

In [38]:
%%sql

-- Menerapkan operator OR
SELECT *
FROM transaction_details
WHERE description='Century front item.' OR transaction_id=66;

 * mysql+mysqldb://root:***@localhost
2 rows affected.

[(6, 'Century front item.'), (66, 'Quality church seven factor couple.')]

In [40]:
%%sql

-- Menerapkan operator NOT
SELECT *
FROM transaction_types
WHERE NOT type='Credit';

 * mysql+mysqldb://root:***@localhost
2 rows affected.

[(2, 'debit'), (3, 'transfer')]

In [46]:
%%sql

-- Memfilter record transaction_details yang kolom description diawali dengan "d"
SELECT *
FROM transaction_details
WHERE description LIKE 'd%';

 * mysql+mysqldb://root:***@localhost
1 rows affected.

[(3, 'Direction wife job pull determine leader move college.')]

In [49]:
%%sql

-- Memfilter record persons yang kolom description diakhiri dengan "e"
SELECT *
FROM transaction_details
WHERE description LIKE '%e.';

 * mysql+mysqldb://root:***@localhost
16 rows affected.

[(2, 'Each left similar likely coach take.'),
 (3, 'Direction wife job pull determine leader move college.'),
 (8, 'Trouble reason speak involve.'),
 (24, 'Speak ever piece whom indicate she.'),
 (30, 'Relate small employee.'),
 (31, 'Wish not live be practice.'),
 (36, 'Newspaper well computer population recently price.'),
 (37, 'Customer sort huge.'),
 (38, 'Message wear indicate.'),
 (40, 'Probably leg indicate.'),
 (47, 'This western whose raise.'),
 (48, 'Own pick someone claim sound watch rise.'),
 (49, 'Threat management consumer resource here else.'),
 (52, 'Budget station reach carry data guess culture space.'),
 (62, 'Put science recognize rest entire.'),
 (66, 'Quality church seven factor couple.')]

In [20]:
%%sql

-- Menerapkan Left Outer Join
SELECT t.transaction_id, t.date, tt.type_id, tt.type, td.description
FROM transactions t
LEFT JOIN transaction_types tt ON t.type_id = tt.type_id
LEFT JOIN transaction_details td ON t.transaction_id = td.transaction_id;

 * mysql+mysqldb://root:***@localhost
66 rows affected.

[(1, datetime.date(2020, 10, 26), 1, 'credit', 'Expect series shake art again our.'),
 (2, datetime.date(2020, 1, 8), 1, 'credit', 'Each left similar likely coach take.'),
 (3, datetime.date(2019, 9, 2), 2, 'debit', 'Direction wife job pull determine leader move college.'),
 (4, datetime.date(2020, 12, 2), 1, 'credit', 'Agree reveal buy black already.'),
 (5, datetime.date(2020, 12, 2), 2, 'debit', 'Child relationship show college whom speech.'),
 (6, datetime.date(2021, 4, 25), 1, 'credit', 'Century front item.'),
 (7, datetime.date(2020, 6, 19), 1, 'credit', 'Market cover loss hotel send.'),
 (8, datetime.date(2022, 9, 8), 1, 'credit', 'Trouble reason speak involve.'),
 (9, datetime.date(2022, 1, 30), 1, 'credit', 'Popular three war arm best.'),
 (10, datetime.date(2020, 8, 20), 1, 'credit', 'Old see watch no.'),
 (11, datetime.date(2019, 12, 9), 2, 'debit', 'Million explain rule boy agree can.'),
 (12, datetime.date(2019, 1, 18), 2, 'debit', 'Us save attention interest country short.'),
 (13, datetime.date(2018, 4, 15), 1, 'credit', 'Media organization structure their cut not where few.'),
 (14, datetime.date(2019, 6, 6), 2, 'debit', 'Available smile make star majority.'),
 (15, datetime.date(2022, 1, 17), 1, 'credit', 'Fund house head course around strategy lead.'),
 (16, datetime.date(2020, 12, 8), 1, 'credit', 'Main few character air.'),
 (17, datetime.date(2021, 6, 5), 3, 'transfer', 'Listen operation enough those society open.'),
 (18, datetime.date(2022, 5, 23), 3, 'transfer', 'Property strategy represent that.'),
 (19, datetime.date(2020, 1, 25), 2, 'debit', 'Soldier green age much sound write chair.'),
 (20, datetime.date(2020, 2, 19), 2, 'debit', 'What single suggest now stop.'),
 (21, datetime.date(2020, 4, 9), 3, 'transfer', 'Support do interesting citizen phone energy consider.'),
 (22, datetime.date(2021, 3, 19), 2, 'debit', 'This pass civil education.'),
 (23, datetime.date(2019, 10, 24), 2, 'debit', 'Choose between staff southern fine not manager nothing.'),
 (24, datetime.date(2021, 9, 2), 1, 'credit', 'Speak ever piece whom indicate she.'),
 (25, datetime.date(2022, 9, 7), 1, 'credit', 'She cover impact program physical.'),
 (26, datetime.date(2018, 9, 4), 1, 'credit', 'Newspaper region sister whose man fight usually.'),
 (27, datetime.date(2018, 5, 16), 1, 'credit', 'Lead talk military including system sometimes few within.'),
 (28, datetime.date(2021, 8, 29), 3, 'transfer', 'Have focus admit again.'),
 (29, datetime.date(2021, 1, 18), 1, 'credit', 'Write allow on.'),
 (30, datetime.date(2022, 6, 5), 3, 'transfer', 'Relate small employee.'),
 (31, datetime.date(2020, 7, 10), 1, 'credit', 'Wish not live be practice.'),
 (32, datetime.date(2022, 7, 10), 1, 'credit', 'Hour down professor risk wear.'),
 (33, datetime.date(2022, 11, 16), 1, 'credit', 'Popular article light indeed.'),
 (34, datetime.date(2018, 3, 30), 3, 'transfer', 'Yet cover consider national your successful computer.'),
 (35, datetime.date(2020, 3, 28), 3, 'transfer', 'Hope moment value article would economic point technology.'),
 (36, datetime.date(2019, 11, 30), 2, 'debit', 'Newspaper well computer population recently price.'),
 (37, datetime.date(2021, 7, 14), 3, 'transfer', 'Customer sort huge.'),
 (38, datetime.date(2022, 6, 16), 3, 'transfer', 'Message wear indicate.'),
 (39, datetime.date(2018, 8, 25), 3, 'transfer', 'Trip carry camera upon reality doctor adult.'),
 (40, datetime.date(2022, 2, 8), 3, 'transfer', 'Probably leg indicate.'),
 (41, datetime.date(2020, 8, 6), 2, 'debit', 'Or few there notice once down indeed per.'),
 (42, datetime.date(2022, 1, 6), 3, 'transfer', 'Research open catch government left.'),
 (43, datetime.date(2021, 12, 9), 3, 'transfer', 'Single understand individual together.'),
 (44, datetime.date(2019, 6, 4), 3, 'transfer', 'Heavy would camera high other appear next.'),
 (45, datetime.date(2021, 9, 15), 1, 'credit', 'Human president myself young option try.'),
 (46, datetime.date(2023, 3, 5), 2, 'debit', 'Run us scientist computer.'),
 (47, datetime.date(2021, 3, 14), 1, 'credit', 'This western whose raise.'),
 (48, datetime.date(2021, 12, 20), 1, 'credit', 'Own pick someone claim sound watch rise.'),
 (49, datetime.date(2021, 6, 27), 3, 'transfer', 'Threat management consumer resource here else.'),
 (50, datetime.date(2022, 5, 27), 3, 'transfer', 'Important stock lot support.'),
 (51, datetime.date(2020, 6, 15), 3, 'transfer', 'Not building manager road.'),
 (52, datetime.date(2022, 1, 19), 2, 'debit', 'Budget station reach carry data guess culture space.'),
 (53, datetime.date(2020, 11, 19), 1, 'credit', 'Improve professor animal fish world.'),
 (54, datetime.date(2021, 1, 2), 1, 'credit', 'Inside Republican suddenly various key.'),
 (55, datetime.date(2021, 12, 27), 2, 'debit', 'Reduce meet government.'),
 (56, datetime.date(2023, 2, 11), 1, 'credit', 'Program should color author should author recent market.'),
 (57, datetime.date(2020, 5, 21), 2, 'debit', 'Can thousand natural opportunity certainly.'),
 (58, datetime.date(2022, 3, 24), 1, 'credit', 'Maybe provide happy impact another forget.'),
 (59, datetime.date(2022, 1, 19), 2, 'debit', 'Well though current send.'),
 (60, datetime.date(2021, 1, 24), 1, 'credit', 'Religious happen start single carry.'),
 (61, datetime.date(2018, 8, 31), 2, 'debit', 'Pass agency than although and.'),
 (62, datetime.date(2021, 11, 3), 2, 'debit', 'Put science recognize rest entire.'),
 (63, datetime.date(2019, 3, 23), 1, 'credit', 'Green campaign here from.'),
 (64, datetime.date(2021, 10, 17), 1, 'credit', 'Speak even thought wrong.'),
 (65, datetime.date(2018, 9, 6), 3, 'transfer', 'Choice guess process central.'),
 (66, datetime.date(2020, 9, 13), 1, 'credit', 'Quality church seven factor couple.')]

### Melakukan user management terhadap 3 user :

In [53]:
%%sql

-- Membuat user_root
CREATE USER 'user_root'@'localhost' IDENTIFIED BY 'password';
GRANT ALL PRIVILEGES ON tugas_besar.* TO 'user_root'@'localhost';

-- Membuat user_1
CREATE USER 'user_1'@'localhost' IDENTIFIED BY 'passwords';
GRANT ALL PRIVILEGES ON tugas_besar.* TO 'user_1'@'localhost';
REVOKE UPDATE ON tugas_besar.* FROM 'user_1'@'localhost';

-- Membuat user_2
CREATE USER 'user_2'@'localhost' IDENTIFIED BY 'passwordss';
GRANT ALL PRIVILEGES ON tugas_besar.* TO 'user_2'@'localhost';
REVOKE CREATE ON tugas_besar.* FROM 'user_2'@'localhost';

 * mysql+mysqldb://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [54]:
%%sql

SHOW GRANTS FOR 'user_root'@'localhost';

 * mysql+mysqldb://root:***@localhost
2 rows affected.

[('GRANT USAGE ON *.* TO `user_root`@`localhost`',),
 ('GRANT ALL PRIVILEGES ON `tugas_besar`.* TO `user_root`@`localhost`',)]

In [55]:
%%sql

SHOW GRANTS FOR 'user_1'@'localhost';

 * mysql+mysqldb://root:***@localhost
2 rows affected.

[('GRANT USAGE ON *.* TO `user_1`@`localhost`',),
 ('GRANT SELECT, INSERT, DELETE, CREATE, DROP, REFERENCES, INDEX, ALTER, CREATE TEMPORARY TABLES, LOCK TABLES, EXECUTE, CREATE VIEW, SHOW VIEW, CREATE ROUTINE, ALTER ROUTINE, EVENT, TRIGGER ON `tugas_besar`.* TO `user_1`@`localhost`',)]

In [56]:
%%sql

SHOW GRANTS FOR 'user_2'@'localhost';

 * mysql+mysqldb://root:***@localhost
2 rows affected.

[('GRANT USAGE ON *.* TO `user_2`@`localhost`',),
 ('GRANT SELECT, INSERT, UPDATE, DELETE, DROP, REFERENCES, INDEX, ALTER, CREATE TEMPORARY TABLES, LOCK TABLES, EXECUTE, CREATE VIEW, SHOW VIEW, CREATE ROUTINE, ALTER ROUTINE, EVENT, TRIGGER ON `tugas_besar`.* TO `user_2`@`localhost`',)]